In [1]:
import pandas as pd
import numpy as np

In [ ]:
#tast---2    The cost column in the dataframe “Project” has some missing values. Your task is to 
#compute these missing values. Replace the missing values by running average. You 
#should use the “For” loop for this task.

In [20]:
df = pd.read_csv("project_data.csv")
print(df)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [25]:
costs = df['Cost'].tolist()
running_sum = 0
count = 0
for i in range(len(costs)):
    if np.isnan(costs[i]):
        # Used running average for missing value
        avg = running_sum / count if count > 0 else 0
        costs[i] = avg
    running_sum += costs[i]
    count += 1

In [26]:

df['Cost'] = costs

In [27]:
print("===== Project DataFrame =====\n")
print(df.to_markdown(index=False))

===== Project DataFrame =====

| ID   | Project    |             Cost | Status   |
|:-----|:-----------|-----------------:|:---------|
| A001 | Project 1  |      1.002e+06   | Finished |
| A002 | Project 2  |      2e+06       | Ongoing  |
| A003 | Project 3  |      4.5e+06     | Finished |
| A004 | Project 4  |      5.5e+06     | Ongoing  |
| A005 | Project 5  |      3.2505e+06  | Finished |
| A002 | Project 6  | 680000           | Failed   |
| A005 | Project 7  | 400000           | Finished |
| A003 | Project 8  | 350000           | Failed   |
| A001 | Project 9  |      2.21031e+06 | Ongoing  |
| A003 | Project 10 | 300000           | Finished |
| A001 | Project 11 |      2e+06       | Failed   |
| A004 | Project 12 |      1e+06       | Ongoing  |
| A004 | Project 13 |      3e+06       | Finished |
| A005 | Project 14 | 200000           | Finished |

In [28]:

pd.set_option('display.float_format', '{:,.0f}'.format)

print("===== Project DataFrame =====\n")
print(df) #tast 2 data frame after changes

===== Project DataFrame =====

      ID     Project      Cost    Status
0   A001   Project 1 1,002,000  Finished
1   A002   Project 2 2,000,000   Ongoing
2   A003   Project 3 4,500,000  Finished
3   A004   Project 4 5,500,000   Ongoing
4   A005   Project 5 3,250,500  Finished
5   A002   Project 6   680,000    Failed
6   A005   Project 7   400,000  Finished
7   A003   Project 8   350,000    Failed
8   A001   Project 9 2,210,312   Ongoing
9   A003  Project 10   300,000  Finished
10  A001  Project 11 2,000,000    Failed
11  A004  Project 12 1,000,000   Ongoing
12  A004  Project 13 3,000,000  Finished
13  A005  Project 14   200,000  Finished

In [3]:
import pandas as pd
import numpy as np

In [ ]:
#Task 3 ---Split the name column in the Employee dataframe into two new columns “First Name”, 
#and “Last Name” and remove the older “name” column.

In [18]:
import os
cwd = os.getcwd()
print("Current working directory:", cwd)

Current working directory: C:\Users\Kumbala Naresh\Downloads\capstone

In [19]:
os.chdir(r"C:\Users\Kumbala Naresh\Downloads\tables")

In [20]:
print(os.getcwd())

C:\Users\Kumbala Naresh\Downloads\tables

In [22]:
Employee = pd.read_csv("Employee DataFrame.csv")
print(Employee)

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [23]:
# Split the 'Name' column into 'First Name' and 'Last Name'
Employee[['First Name', 'Last Name']] = Employee['Name'].str.split(' ', n=1, expand=True)
print(Employee)

     ID             Name Gender     City  Age First Name  Last Name
0  A001       John Alter      M    Paris   25       John      Alter
1  A002  Alice Luxumberg      F   London   27      Alice  Luxumberg
2  A003    Tom Sabestine      M   Berlin   29        Tom  Sabestine
3  A004       Nina Adgra      F  Newyork   31       Nina      Adgra
4  A005        Amy Johny      F   Madrid   30        Amy      Johny

In [24]:
# Removed the original 'Name' column
Employee.drop('Name', axis=1, inplace=True)
print(Employee)

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [ ]:
#  task---4 Join all three dataframes in one single dataframe. Name it “Final”

In [26]:
df3=pd.read_csv("seniority_levels.csv")   #getting seniority Level DataFrameEmployee dataframe
print(df3)

     ID  Designation level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [40]:
pd.set_option('display.float_format', '{:,.0f}'.format)

print("===== Project DataFrame =====\n")
print(df)

===== Project DataFrame =====

      ID     Project      Cost    Status
0   A001   Project 1 1,002,000  Finished
1   A002   Project 2 2,000,000   Ongoing
2   A003   Project 3 4,500,000  Finished
3   A004   Project 4 5,500,000   Ongoing
4   A005   Project 5 3,250,500  Finished
5   A002   Project 6   680,000    Failed
6   A005   Project 7   400,000  Finished
7   A003   Project 8   350,000    Failed
8   A001   Project 9 2,210,312   Ongoing
9   A003  Project 10   300,000  Finished
10  A001  Project 11 2,000,000    Failed
11  A004  Project 12 1,000,000   Ongoing
12  A004  Project 13 3,000,000  Finished
13  A005  Project 14   200,000  Finished

In [41]:
df_twotables = pd.merge(Employee, df3, on="ID") #merging employee and seniority data frame

In [42]:
Final = pd.merge(df,df_twotables,on="ID")

In [43]:
print(Final) #after all tables joining final tabel on ID bases

      ID     Project      Cost    Status Gender     City  Age First Name  \
0   A001   Project 1 1,002,000  Finished      M    Paris   25       John
1   A002   Project 2 2,000,000   Ongoing      F   London   27      Alice
2   A003   Project 3 4,500,000  Finished      M   Berlin   29        Tom
3   A004   Project 4 5,500,000   Ongoing      F  Newyork   31       Nina
4   A005   Project 5 3,250,500  Finished      F   Madrid   30        Amy
5   A002   Project 6   680,000    Failed      F   London   27      Alice
6   A005   Project 7   400,000  Finished      F   Madrid   30        Amy
7   A003   Project 8   350,000    Failed      M   Berlin   29        Tom
8   A001   Project 9 2,210,312   Ongoing      M    Paris   25       John
9   A003  Project 10   300,000  Finished      M   Berlin   29        Tom
10  A001  Project 11 2,000,000    Failed      M    Paris   25       John
11  A004  Project 12 1,000,000   Ongoing      F  Newyork   31       Nina
12  A004  Project 13 3,000,000  Finished      F  Newyork   31       Nina
13  A005  Project 14   200,000  Finished      F   Madrid   30        Amy

    Last Name  Designation level
0       Alter                  2
1   Luxumberg                  2
2   Sabestine                  3
3       Adgra                  2
4       Johny                  3
5   Luxumberg                  2
6       Johny                  3
7   Sabestine                  3
8       Alter                  2
9   Sabestine                  3
10      Alter                  2
11      Adgra                  2
12      Adgra                  2
13      Johny                  3

In [ ]:
#Task--5   Add a new bonus column in the Final dataframe. Give a 5% bonus concerning project 
#cost only to employees who have finished the projects.

In [45]:
Final["Bonus"] = Final.apply(
    lambda row: row["Cost"] * 0.05 if row["Status"] == "Finished" and pd.notnull(row["Cost"]) else 0,
    axis=1
)

In [46]:
print(Final)

      ID     Project      Cost    Status Gender     City  Age First Name  \
0   A001   Project 1 1,002,000  Finished      M    Paris   25       John
1   A002   Project 2 2,000,000   Ongoing      F   London   27      Alice
2   A003   Project 3 4,500,000  Finished      M   Berlin   29        Tom
3   A004   Project 4 5,500,000   Ongoing      F  Newyork   31       Nina
4   A005   Project 5 3,250,500  Finished      F   Madrid   30        Amy
5   A002   Project 6   680,000    Failed      F   London   27      Alice
6   A005   Project 7   400,000  Finished      F   Madrid   30        Amy
7   A003   Project 8   350,000    Failed      M   Berlin   29        Tom
8   A001   Project 9 2,210,312   Ongoing      M    Paris   25       John
9   A003  Project 10   300,000  Finished      M   Berlin   29        Tom
10  A001  Project 11 2,000,000    Failed      M    Paris   25       John
11  A004  Project 12 1,000,000   Ongoing      F  Newyork   31       Nina
12  A004  Project 13 3,000,000  Finished      F  Newyork   31       Nina
13  A005  Project 14   200,000  Finished      F   Madrid   30        Amy

    Last Name  Designation level   Bonus
0       Alter                  2  50,100
1   Luxumberg                  2       0
2   Sabestine                  3 225,000
3       Adgra                  2       0
4       Johny                  3 162,525
5   Luxumberg                  2       0
6       Johny                  3  20,000
7   Sabestine                  3       0
8       Alter                  2       0
9   Sabestine                  3  15,000
10      Alter                  2       0
11      Adgra                  2       0
12      Adgra                  2 150,000
13      Johny                  3  10,000

In [ ]:
# Task-- 6     Demote the designation level by 1, whose projects have status “fail”. Delete the 
#employees record whose designation level is above 4.

In [47]:
# Decrease designation level by 1 for failed projects
Final.loc[Final["Status"] == "Failed", "Designation level"] -= 1

In [48]:
print(Final)

      ID     Project      Cost    Status Gender     City  Age First Name  \
0   A001   Project 1 1,002,000  Finished      M    Paris   25       John
1   A002   Project 2 2,000,000   Ongoing      F   London   27      Alice
2   A003   Project 3 4,500,000  Finished      M   Berlin   29        Tom
3   A004   Project 4 5,500,000   Ongoing      F  Newyork   31       Nina
4   A005   Project 5 3,250,500  Finished      F   Madrid   30        Amy
5   A002   Project 6   680,000    Failed      F   London   27      Alice
6   A005   Project 7   400,000  Finished      F   Madrid   30        Amy
7   A003   Project 8   350,000    Failed      M   Berlin   29        Tom
8   A001   Project 9 2,210,312   Ongoing      M    Paris   25       John
9   A003  Project 10   300,000  Finished      M   Berlin   29        Tom
10  A001  Project 11 2,000,000    Failed      M    Paris   25       John
11  A004  Project 12 1,000,000   Ongoing      F  Newyork   31       Nina
12  A004  Project 13 3,000,000  Finished      F  Newyork   31       Nina
13  A005  Project 14   200,000  Finished      F   Madrid   30        Amy

    Last Name  Designation level   Bonus
0       Alter                  2  50,100
1   Luxumberg                  2       0
2   Sabestine                  3 225,000
3       Adgra                  2       0
4       Johny                  3 162,525
5   Luxumberg                  1       0
6       Johny                  3  20,000
7   Sabestine                  2       0
8       Alter                  2       0
9   Sabestine                  3  15,000
10      Alter                  1       0
11      Adgra                  2       0
12      Adgra                  2 150,000
13      Johny                  3  10,000

In [49]:
#Remove employees with designation level above 4
Final = Final[Final["Designation level"] <= 4]

In [50]:
print(Final)

      ID     Project      Cost    Status Gender     City  Age First Name  \
0   A001   Project 1 1,002,000  Finished      M    Paris   25       John
1   A002   Project 2 2,000,000   Ongoing      F   London   27      Alice
2   A003   Project 3 4,500,000  Finished      M   Berlin   29        Tom
3   A004   Project 4 5,500,000   Ongoing      F  Newyork   31       Nina
4   A005   Project 5 3,250,500  Finished      F   Madrid   30        Amy
5   A002   Project 6   680,000    Failed      F   London   27      Alice
6   A005   Project 7   400,000  Finished      F   Madrid   30        Amy
7   A003   Project 8   350,000    Failed      M   Berlin   29        Tom
8   A001   Project 9 2,210,312   Ongoing      M    Paris   25       John
9   A003  Project 10   300,000  Finished      M   Berlin   29        Tom
10  A001  Project 11 2,000,000    Failed      M    Paris   25       John
11  A004  Project 12 1,000,000   Ongoing      F  Newyork   31       Nina
12  A004  Project 13 3,000,000  Finished      F  Newyork   31       Nina
13  A005  Project 14   200,000  Finished      F   Madrid   30        Amy

    Last Name  Designation level   Bonus
0       Alter                  2  50,100
1   Luxumberg                  2       0
2   Sabestine                  3 225,000
3       Adgra                  2       0
4       Johny                  3 162,525
5   Luxumberg                  1       0
6       Johny                  3  20,000
7   Sabestine                  2       0
8       Alter                  2       0
9   Sabestine                  3  15,000
10      Alter                  1       0
11      Adgra                  2       0
12      Adgra                  2 150,000
13      Johny                  3  10,000

In [ ]:
# Task--7   Add “Mr.” and “Mrs.” to the first name column and drop the gender column.

In [53]:
# Add prefix based on gender
Final["First Name"] = Final.apply(
    lambda row: f"Mr. {row['First Name']}" if row["Gender"] == "M" else f"Mrs. {row['First Name']}",
    axis=1
)

In [54]:
print(Final)

      ID     Project      Cost    Status Gender     City  Age  First Name  \
0   A001   Project 1 1,002,000  Finished      M    Paris   25    Mr. John
1   A002   Project 2 2,000,000   Ongoing      F   London   27  Mrs. Alice
2   A003   Project 3 4,500,000  Finished      M   Berlin   29     Mr. Tom
3   A004   Project 4 5,500,000   Ongoing      F  Newyork   31   Mrs. Nina
4   A005   Project 5 3,250,500  Finished      F   Madrid   30    Mrs. Amy
5   A002   Project 6   680,000    Failed      F   London   27  Mrs. Alice
6   A005   Project 7   400,000  Finished      F   Madrid   30    Mrs. Amy
7   A003   Project 8   350,000    Failed      M   Berlin   29     Mr. Tom
8   A001   Project 9 2,210,312   Ongoing      M    Paris   25    Mr. John
9   A003  Project 10   300,000  Finished      M   Berlin   29     Mr. Tom
10  A001  Project 11 2,000,000    Failed      M    Paris   25    Mr. John
11  A004  Project 12 1,000,000   Ongoing      F  Newyork   31   Mrs. Nina
12  A004  Project 13 3,000,000  Finished      F  Newyork   31   Mrs. Nina
13  A005  Project 14   200,000  Finished      F   Madrid   30    Mrs. Amy

    Last Name  Designation level   Bonus
0       Alter                  2  50,100
1   Luxumberg                  2       0
2   Sabestine                  3 225,000
3       Adgra                  2       0
4       Johny                  3 162,525
5   Luxumberg                  1       0
6       Johny                  3  20,000
7   Sabestine                  2       0
8       Alter                  2       0
9   Sabestine                  3  15,000
10      Alter                  1       0
11      Adgra                  2       0
12      Adgra                  2 150,000
13      Johny                  3  10,000

In [55]:
# Drop the Gender column
Final.drop(columns=["Gender"], inplace=True)

In [56]:
print(Final)

      ID     Project      Cost    Status     City  Age  First Name  Last Name  \
0   A001   Project 1 1,002,000  Finished    Paris   25    Mr. John      Alter
1   A002   Project 2 2,000,000   Ongoing   London   27  Mrs. Alice  Luxumberg
2   A003   Project 3 4,500,000  Finished   Berlin   29     Mr. Tom  Sabestine
3   A004   Project 4 5,500,000   Ongoing  Newyork   31   Mrs. Nina      Adgra
4   A005   Project 5 3,250,500  Finished   Madrid   30    Mrs. Amy      Johny
5   A002   Project 6   680,000    Failed   London   27  Mrs. Alice  Luxumberg
6   A005   Project 7   400,000  Finished   Madrid   30    Mrs. Amy      Johny
7   A003   Project 8   350,000    Failed   Berlin   29     Mr. Tom  Sabestine
8   A001   Project 9 2,210,312   Ongoing    Paris   25    Mr. John      Alter
9   A003  Project 10   300,000  Finished   Berlin   29     Mr. Tom  Sabestine
10  A001  Project 11 2,000,000    Failed    Paris   25    Mr. John      Alter
11  A004  Project 12 1,000,000   Ongoing  Newyork   31   Mrs. Nina      Adgra
12  A004  Project 13 3,000,000  Finished  Newyork   31   Mrs. Nina      Adgra
13  A005  Project 14   200,000  Finished   Madrid   30    Mrs. Amy      Johny

    Designation level   Bonus
0                   2  50,100
1                   2       0
2                   3 225,000
3                   2       0
4                   3 162,525
5                   1       0
6                   3  20,000
7                   2       0
8                   2       0
9                   3  15,000
10                  1       0
11                  2       0
12                  2 150,000
13                  3  10,000

In [ ]:
#Task---8  Promote designation level by 1 for the employees whose age is more than 29 years using 
#IF condition.

In [64]:
# Promoted designation level by 1 for employees older than 29
Final["Designation level Promoted"] = Final.apply(
    lambda row: row["Designation level"] + 1 if row["Age"] > 29 else row["Designation level"],
    axis=1
)

In [65]:
print(Final)

      ID     Project      Cost    Status     City  Age  First Name  Last Name  \
0   A001   Project 1 1,002,000  Finished    Paris   25    Mr. John      Alter
1   A002   Project 2 2,000,000   Ongoing   London   27  Mrs. Alice  Luxumberg
2   A003   Project 3 4,500,000  Finished   Berlin   29     Mr. Tom  Sabestine
3   A004   Project 4 5,500,000   Ongoing  Newyork   31   Mrs. Nina      Adgra
4   A005   Project 5 3,250,500  Finished   Madrid   30    Mrs. Amy      Johny
5   A002   Project 6   680,000    Failed   London   27  Mrs. Alice  Luxumberg
6   A005   Project 7   400,000  Finished   Madrid   30    Mrs. Amy      Johny
7   A003   Project 8   350,000    Failed   Berlin   29     Mr. Tom  Sabestine
8   A001   Project 9 2,210,312   Ongoing    Paris   25    Mr. John      Alter
9   A003  Project 10   300,000  Finished   Berlin   29     Mr. Tom  Sabestine
10  A001  Project 11 2,000,000    Failed    Paris   25    Mr. John      Alter
11  A004  Project 12 1,000,000   Ongoing  Newyork   31   Mrs. Nina      Adgra
12  A004  Project 13 3,000,000  Finished  Newyork   31   Mrs. Nina      Adgra
13  A005  Project 14   200,000  Finished   Madrid   30    Mrs. Amy      Johny

    Designation level   Bonus  Designation level1  Designation level Promoted
0                   2  50,100                   2                           2
1                   2       0                   2                           2
2                   3 225,000                   3                           3
3                   3       0                   4                           4
4                   4 162,525                   5                           5
5                   1       0                   1                           1
6                   4  20,000                   5                           5
7                   2       0                   2                           2
8                   2       0                   2                           2
9                   3  15,000                   3                           3
10                  1       0                   1                           1
11                  3       0                   4                           4
12                  3 150,000                   4                           4
13                  4  10,000                   5                           5

In [66]:
Final.drop(columns=["Designation level1"], inplace=True)

In [67]:
print(Final)

      ID     Project      Cost    Status     City  Age  First Name  Last Name  \
0   A001   Project 1 1,002,000  Finished    Paris   25    Mr. John      Alter
1   A002   Project 2 2,000,000   Ongoing   London   27  Mrs. Alice  Luxumberg
2   A003   Project 3 4,500,000  Finished   Berlin   29     Mr. Tom  Sabestine
3   A004   Project 4 5,500,000   Ongoing  Newyork   31   Mrs. Nina      Adgra
4   A005   Project 5 3,250,500  Finished   Madrid   30    Mrs. Amy      Johny
5   A002   Project 6   680,000    Failed   London   27  Mrs. Alice  Luxumberg
6   A005   Project 7   400,000  Finished   Madrid   30    Mrs. Amy      Johny
7   A003   Project 8   350,000    Failed   Berlin   29     Mr. Tom  Sabestine
8   A001   Project 9 2,210,312   Ongoing    Paris   25    Mr. John      Alter
9   A003  Project 10   300,000  Finished   Berlin   29     Mr. Tom  Sabestine
10  A001  Project 11 2,000,000    Failed    Paris   25    Mr. John      Alter
11  A004  Project 12 1,000,000   Ongoing  Newyork   31   Mrs. Nina      Adgra
12  A004  Project 13 3,000,000  Finished  Newyork   31   Mrs. Nina      Adgra
13  A005  Project 14   200,000  Finished   Madrid   30    Mrs. Amy      Johny

    Designation level   Bonus  Designation level Promoted
0                   2  50,100                           2
1                   2       0                           2
2                   3 225,000                           3
3                   3       0                           4
4                   4 162,525                           5
5                   1       0                           1
6                   4  20,000                           5
7                   2       0                           2
8                   2       0                           2
9                   3  15,000                           3
10                  1       0                           1
11                  3       0                           4
12                  3 150,000                           4
13                  4  10,000                           5

In [ ]:
#  Task---9   Add the cost of all projects for each Employee and save it in new dataframe 
#  “TotalProjCost” with three columns ID, First Name, and Total cost

In [73]:
print(Final)

      ID     Project      Cost    Status     City  Age  First Name  Last Name  \
0   A001   Project 1 1,002,000  Finished    Paris   25    Mr. John      Alter
1   A002   Project 2 2,000,000   Ongoing   London   27  Mrs. Alice  Luxumberg
2   A003   Project 3 4,500,000  Finished   Berlin   29     Mr. Tom  Sabestine
3   A004   Project 4 5,500,000   Ongoing  Newyork   31   Mrs. Nina      Adgra
4   A005   Project 5 3,250,500  Finished   Madrid   30    Mrs. Amy      Johny
5   A002   Project 6   680,000    Failed   London   27  Mrs. Alice  Luxumberg
6   A005   Project 7   400,000  Finished   Madrid   30    Mrs. Amy      Johny
7   A003   Project 8   350,000    Failed   Berlin   29     Mr. Tom  Sabestine
8   A001   Project 9 2,210,312   Ongoing    Paris   25    Mr. John      Alter
9   A003  Project 10   300,000  Finished   Berlin   29     Mr. Tom  Sabestine
10  A001  Project 11 2,000,000    Failed    Paris   25    Mr. John      Alter
11  A004  Project 12 1,000,000   Ongoing  Newyork   31   Mrs. Nina      Adgra
12  A004  Project 13 3,000,000  Finished  Newyork   31   Mrs. Nina      Adgra
13  A005  Project 14   200,000  Finished   Madrid   30    Mrs. Amy      Johny

    Designation level   Bonus  Designation level Promoted
0                   2  50,100                           2
1                   2       0                           2
2                   3 225,000                           3
3                   3       0                           4
4                   4 162,525                           5
5                   1       0                           1
6                   4  20,000                           5
7                   2       0                           2
8                   2       0                           2
9                   3  15,000                           3
10                  1       0                           1
11                  3       0                           4
12                  3 150,000                           4
13                  4  10,000                           5

In [74]:
# Group by ID and First Name, summing the Cost

TotalProjCost = Final.groupby(["ID", "First Name"], as_index=False)["Cost"].sum()

In [75]:
# Rename the column for clarity
TotalProjCost.rename(columns={"Cost": "Total Cost"}, inplace=True)

In [76]:
print(TotalProjCost)

     ID  First Name  Total Cost
0  A001    Mr. John   5,212,312
1  A002  Mrs. Alice   2,680,000
2  A003     Mr. Tom   5,150,000
3  A004   Mrs. Nina   9,500,000
4  A005    Mrs. Amy   3,850,500

In [ ]:
# task 10---Print all the employee details whose city name contains the letter “o” in it.

In [ ]:
# Print all the employee details whose city name contains the letter “o” in it.

In [90]:
employees_with_o = Final[Final["City"].str.contains("o", case=False, na=False)]

In [91]:
employees_with_o

,ID,Project,Cost,Status,City,Age,First Name,Last Name,Designation level,Bonus,Designation level Promoted
1,A002,Project 2,"2,000,000",Ongoing,London,27,Mrs. Alice,Luxumberg,2,0,2
3,A004,Project 4,"5,500,000",Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0,4
5,A002,Project 6,"680,000",Failed,London,27,Mrs. Alice,Luxumberg,1,0,1
11,A004,Project 12,"1,000,000",Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0,4
12,A004,Project 13,"3,000,000",Finished,Newyork,31,Mrs. Nina,Adgra,3,"150,000",4